# 데이터베이스 프로그래밍
## db 접속하기
### 필요한 라이브러리 참조

In [13]:
from sqlalchemy import create_engine, text
from pandas import DataFrame

In [14]:
config = {
    'username': 'root',
    'password': '1234',
    'hostname': 'localhost',
    'port': 9090,
    'database': 'myschool',
    'charset': 'utf8mb4'
}

con_str_tpl = "mariadb+pymysql://{username}:{password}@{hostname}:{port}/{database}?charset={charset}"

con_str = con_str_tpl.format(**config)
print(con_str)

mariadb+pymysql://root:1234@localhost:9090/myschool?charset=utf8mb4

In [15]:
try:
    # con_str은 직전 블록에서 생성한 변수를 재사용하고 있음
    engine = create_engine(con_str)
    # 데이터베이스에 접속하여 SQL 실행 객체를 리턴받는다.
    conn = engine.connect()
    print("Database connect success!!!")
except Exception as e:
    print("Database connect fail!!!", e)

Database connect success!!!

## 단일행 데이터 조회하기

### 단 하나의 행을 조회하는 SQL문 실행하기

In [16]:
# SQL문 정의
sql = text("SELECT id, name, grade, department_id FROM students WHERE id=10101")

try:
    # SQL문을 실행하여 결과 객체 받기
    result = conn.execute(sql)
except Exception as e:
    print("[SQL Error]", e)
    # 코드의 진행을 중단시킴
    raise SystemExit

# SQL문 실행 결과를 딕셔너리를 포함하는 리스트 형태로 변환
resultset = result.mappings().all()
print(resultset)

[{'id': 10101, 'name': '황진우', 'grade': 1, 'department_id': 101}]

## Where절에 사용할 조건값을 변수로 만들기
### 형식 문자를 포함하는 SQL 실행

In [17]:
# 검색할 조건값 입력받기
student_id = input("검색할 학번을 입력")

#SQL문 정의 -> 변수로 치환할 부분을 ':변수명" 형식으로 처리함
sql = text("SELECT id, name, grade, department_id FROM students WHERE id = :student_id")

# SQL문의 물음표를 치환할 값을 딕셔너리로 묶음 (물음표 순서에 따라 조합)
params = {"student_id": student_id}

try:
    #SQL문을 실행하여 결과 객체 받기 -> 치환할 값에 대한 딕셔너리도 함께 전달
    result = conn.execute(sql, params)
except Exception as e:
    print("[SQL Error]", e)
    # 코드의 진행을 중단시킴
    raise SystemExit

# 단일행 조회에 대한 결과 집합 추출하기
resultset = result.mappings().all()
print(resultset)

[{'id': 10101, 'name': '황진우', 'grade': 1, 'department_id': 101}]

## 다중행 데이터 조회
### 여러 행을 반환하는 SQL문 실행하기

In [18]:
# SQL문 정의
sql = text('SELECT id, dname, loc, phone, email FROM departments LIMIT 0, 5')

try:
    #SQL문을 실행하여 결과 객체 받기
    result = conn.execute(sql)
except Exception as e:
    print("[SQL Error]",e)
    # 코드의 진행을 중단시킴
    raise SystemExit

# 단일행 조회에 대한 결과 집합 추출하기
resultset = result.mappings().all()
print(resultset)

[{'id': 101, 'dname': '컴퓨터공학과', 'loc': '공학관', 'phone': '051-123-4567', 'email': 'cs@myschool.ac.kr'}, {'id': 102, 'dname': '소프트웨어학과', 'loc': '공학관', 'phone': '051-124-4567', 'email': 'media@myschool.ac.kr'}, {'id': 201, 'dname': '전자공학과', 'loc': '공학관', 'phone': '051-125-4567', 'email': 'ee@myschool.ac.kr'}, {'id': 202, 'dname': '기계공학과', 'loc': '공학관', 'phone': '051-126-4567', 'email': 'me@myschool.ac.kr'}, {'id': 203, 'dname': '건축학과', 'loc': '건축관', 'phone': '051-127-4567', 'email': 'arch@myschool.ac.kr'}]

## 결과 집합 사용하기
### 반복문을 활용한 데이터 출력

In [19]:
# 리스트의 길이는 조회된 결과 집합의 수
# 'resultset'은 직전 코드 블록에서 생성한 객체
print("총 %d건의 데이터 조회됨"% len(resultset))

# 출력을 위한 문자열 템플릿
tmpl = "학과번회 {id}, 학과이름: {dname}, 위치: {loc}, 연락처: {phone}, 이메일: {email}"

# 반복문으로 문자열 포매팅을 수행하면서 개별 행을 하나씩 출력한다.
for row in resultset:
    print(tmpl.format(**row))

총 5건의 데이터 조회됨
학과번회 101, 학과이름: 컴퓨터공학과, 위치: 공학관, 연락처: 051-123-4567, 이메일: cs@myschool.ac.kr
학과번회 102, 학과이름: 소프트웨어학과, 위치: 공학관, 연락처: 051-124-4567, 이메일: media@myschool.ac.kr
학과번회 201, 학과이름: 전자공학과, 위치: 공학관, 연락처: 051-125-4567, 이메일: ee@myschool.ac.kr
학과번회 202, 학과이름: 기계공학과, 위치: 공학관, 연락처: 051-126-4567, 이메일: me@myschool.ac.kr
학과번회 203, 학과이름: 건축학과, 위치: 건축관, 연락처: 051-127-4567, 이메일: arch@myschool.ac.kr

## 결과 집합 사용하기
### 결과 집합을 표 형태로 변환

In [20]:
# 'resultset'은 직전 코드 블록에서 사용한 객체를 재사용함
df1 = DataFrame(resultset)

# Phython 출력문으로 출력하기
print(df1)

     dname                 email   id  loc         phone
0   컴퓨터공학과     cs@myschool.ac.kr  101  공학관  051-123-4567
1  소프트웨어학과  media@myschool.ac.kr  102  공학관  051-124-4567
2    전자공학과     ee@myschool.ac.kr  201  공학관  051-125-4567
3    기계공학과     me@myschool.ac.kr  202  공학관  051-126-4567
4     건축학과   arch@myschool.ac.kr  203  건축관  051-127-4567

## 결과 집합 사용하기
### 주피터의 고유 기능을 활용하여 표 형태로 출력하기

In [21]:
# 'resultset'은 직전 코드 블록에서 사용한 객체를 재사용함
df2 = DataFrame(resultset)

#print() 함수를 사용하지 않고 주피터를 통해 결과를 출력한다
df2

     dname                 email   id  loc         phone
0   컴퓨터공학과     cs@myschool.ac.kr  101  공학관  051-123-4567
1  소프트웨어학과  media@myschool.ac.kr  102  공학관  051-124-4567
2    전자공학과     ee@myschool.ac.kr  201  공학관  051-125-4567
3    기계공학과     me@myschool.ac.kr  202  공학관  051-126-4567
4     건축학과   arch@myschool.ac.kr  203  건축관  051-127-4567

## 입력값에 따른 검색 결과 만들기

In [26]:
# 검색어
Keyword = input("검색할 교수 이름을 입력하세요")

#SQL 문 정의(치환된 문자는 홑따옴표 사용 안함
sql = text("""SELECT
           p.id As 교수번호, name As 이름, position As 직급, sal As 급여,
           comm As 보직수당, hiredate As 입사일시, dname As 소속학과
        FROM professors p
        INNER JOIN departments d ON p.department_id = d.id
        WHERE name LIKE concat('%', :Keyword, '%')""")

# SQL 문 실행하기
try:
    result = conn.execute(sql, {"Keyword":Keyword})
except Exception as e:
    print("[SQL Error]", e)
    raise SystemExit

#조회결과를 표로 출력
resultset = result.mappings().all()
df = DataFrame(resultset)
df

   교수번호   급여  보직수당     소속학과   이름                입사일시  직급
0  9906  300    21  소프트웨어학과  김현주 2006-08-31 01:04:24  교수

## 데이터 입력/수정/삭제
### 데이터 입력하기

In [29]:
# 데이터를 저장하기 위한 SQL문 템플릿 구성
sql = text("""
           INSERT INTO students(
           name, user_id, grade, idnum, birthdate, phone, height,
           weight, email, gender, status, admission_date, department_id
           ) VALUES (
           :name, :user_id, :grade, MD5(:idnum), :birthdate, :phone, :height,
           :weight, :email, :gender, :status, :admission_date, :department_id
           )
         """)

# SQL문에 치환할 실제 값
new_student = {
    'name':'나신입', 'user_id': 'newbie', 'grade': 1, 'idnum':'9205171000000', 'birthdate': '2024-03-15', 'phone': '010-9876-5432', 'height':175,
           'weight': 82, 'email':'newbie@myschool.ac.kr', 'gender':'남',
            'status': '재학', 'admission_date': '2028-02-12', 'department_id':101
}

### 데이터 입력하기(2)

In [31]:
try:
    result = conn.execute(sql, new_student)
    affected_rows = result.rowcount
    conn.commit()
    
    # 생성된 PK값 추출하기
    pk_result = conn.execute(text("SELECT LAST_INSERT_ID()"))
    pk = pk_result.scalar()
except Exception as e:
    print("SQL Error:", e)
    conn.rollback()
    raise SystemExit

# INSERT문의 결과로 생성된  Premary Key값을 확인한다.
print("저장된 행의 수:", affected_rows,", 신규 학생 ID:", pk)

저장된 행의 수: 1 , 신규 학생 ID: 12347

### 데이터 수정하기

In [34]:
# 특정 학생의 연락처와 이메일 수정하기
sql = text("UPDATE students SET phone=:phone, email=:email WHERE id=:id")

# 수정할 데이터 준비
params = {"phone": "010-1234-5678", "email": "jinwoo.h@myschool.ac.kr", "id": 10102}

# SQL문 실행하기
try:
    result = conn.execute(sql,params)
    conn.commit()
except Exception as e:
    print(f"데이터 수정 오류: {e}")
    conn.rollback()
    raise SystemExit
print("수정된 데이터 수:", result.rowcount)

수정된 데이터 수: 1

## 데이터 삭제하기

In [35]:
# 특정 학생 수강내역 삭제하기
sql = text("DELETE FROM enrollments WHERE student_id=:id")

# 수정할 데이터 준비
params = {"id": 10102}

#SQl문 실행하기
try:
    result = conn.execute(sql, params)
    conn.commit()
except Exception as e:
    print(f"데이터 삭제 오류: {e}")
    conn.rollback()
    raise SystemExit

print("삭제된 데이터 수:", result.rowcount)

삭제된 데이터 수: 2

# Pandas 활용 데이터 조회
## 기본 데이터 조회

### 필요한 모듈 참조하기

In [37]:
from pandas import read_sql

### 검색 조건을 입력 받아서 직접 가져오기

In [39]:
min_height = int(input("키의 하한값을 입력하세요."))
max_height = int(input("키의 상한값을 입력하세요."))

sql = text("""
           SELECT id, name, grade, height, weight, gender
           FROM students
           WHERE height BETWEEN :min AND :max""")

try:
    df = read_sql(sql, conn, params={"min": min_height, "max":max_height})
except Exception as e:
    print("SQL Error:", e)
    raise SystemExit

df

       id name  grade  height  weight gender
0   10101  황진우      1     151      62      남
1   10102  서순옥      4     152      46      남
2   10103  백순옥      2     184      71      남
3   10104  김서연      4     171      62      남
4   10105  박미영      1     172      67      여
..    ...  ...    ...     ...     ...    ...
69  10174  이지민      4     162      49      남
70  10176  장지후      1     172      62      남
71  10177  김하늘      1     162      51      여
72  12346  나신입      1     175      82      남
73  12347  나신입      1     175      82      남

[74 rows x 6 columns]

## 검색 결과를 파일로 저장하기

### CSV 파일로 저장하기

In [40]:
df.to_csv("학생목록.csv", encoding="utf-8")

## 검색 결과를 파일로 저장하기

### 엑셀 파일로 저장하기

In [42]:
df.to_excel("학생목록.xlsx")

## 연구과제

In [171]:
import pymysql
import csv

In [172]:
import pandas as pd

In [173]:
from sqlalchemy import create_engine, text

In [174]:
config = {
    'username': 'root',
    'password': '1234',
    'hostname': 'localhost',
    'port': 9090,
    'database': 'myschool',
    'charset':'utf8mb4'
}

con_str_tpl = 'mariadb+pymysql://{username}:{password}@{hostname}:{port}/{database}?charset={charset}'

con_str = con_str_tpl.format(**config)
print(con_str)

mariadb+pymysql://root:1234@localhost:9090/myschool?charset=utf8mb4

In [175]:
try:
    engine = create_engine(con_str)
    conn = engine.connect()
    print("success")
except Exception as e:
    print("fail", e)

success

In [ ]:
creat_sql = text("""
CREATE TABLE IF NOT EXISTS covid19(
    id INT PRIMARY KEY AUTO_INCREMENT COMMENT '번호',
    date Date COMMENT '날짜',
    s_confirmed int COMMENT '서울일일확진자수',
    s_death int COMMENT '서울일일사망자수',
    a_confirmed int COMMENT '전국일일확진자수',
    a_death int COMMENT '전국일일사망자수'
);
""")

try:
    result = conn.execute(creat_sql)
    conn.commit()
except Exception as e:
    print("[SQL Error - create]", e)
    raise SystemExit

In [182]:
with open("covid19.csv", "r", encoding="cp949") as f:
    reader = csv.reader(f)
    header = next(reader)
    try:
        with conn.begin():
          for row in reader:
            data = {
              "date": row[0],
              's_confirmed': int(row[1]) if row[1] else 0,
              's_death': int(row[2]) if row[2] else 0,
              'a_confirmed': int(row[3]) if row[3] else 0,
              'a_death': int(row[4]) if row[4] else 0
              }
            conn.execute(sql, data)
        print("✅ CSV 데이터가 DB에 성공적으로 저장되었습니다!")

    except Exception as e:
        print("[SQL Error]", e)
        conn.rollback()

✅ CSV 데이터가 DB에 성공적으로 저장되었습니다!

In [183]:
insert_sql = text("""
           INSERT INTO covid19(
            date, s_confirmed, s_death, a_confirmed, a_death)
           VALUES (
            :date, :s_confirmed, :s_death, :a_confirmed, :a_death)
           """)

In [181]:
print(header)
for row in reader:
    print(row)

['날짜', '서울시 일일 확진', '서울시 일일 사망', '전국 일일 확진', '전국 일일 사망']

ValueError: I/O operation on closed file.

In [ ]:
SELECT 
    YEAR(date) AS 년도,
    MONTH(date) AS 월,
    SUM(s_confirmed) AS 서울확진자합계,
    SUM(s_death) AS 서울사망자합계,
    SUM(a_confirmed) AS 전국확진자합계,
    SUM(a_death) AS 전국사망자합계
FROM covid19
GROUP BY YEAR(date), MONTH(date)
ORDER BY YEAR(date), MONTH(date);